'''
Условие
Дан список чисел. Если в нем есть два соседних элемента одного знака, выведите эти числа. Если соседних элементов одного знака нет — не выводите ничего. Если таких пар соседей несколько — выведите первую пару. 

'''

# Мое решение 
a = [int(s) for s in input().split()]

for i in range(1, len(a)):
      if (a[i] >= 0 and a[i -1] >= 0) or (a[i] <= 0 and a[i -1] <= 0):
          print(a[i - 1],a[i])
          break;

# Правильное решение
a = [int(i) for i in input().split()]
for i in range(1, len(a)):
    if a[i - 1] * a[i] > 0:
        print(a[i - 1], a[i])
        break
