'''
Условие
Дано натуральное число. Выведите его последнюю цифру.
'''

x = float(input())
x = x % 10
print(x)