'''
Условие
Дано натуральное число. Найдите число десятков в его десятичной записи.
'''

h = int(input())
print ( ( h // 10 ) % 10)
