'''
Условие

Дана строка. Замените в этой строке все цифры 1 на слово one. 
'''

s = input()
s1 = s.replace('1','one')

print(s1)
