'''
Условие

Дана строка, состоящая из слов, разделенных пробелами.
Определите, сколько в ней слов. Используйте для решения задачи метод count. 
'''

s = input()
print(int(s.count(' '))+1)